#include "StdInc.h"

#include <atArray.h>
#include <Local.h>
#include <Hooking.h>
#include <ScriptEngine.h>
#include <nutsnbolts.h>
#include <atPool.h>
#include <DirectXMath.h>
#include <CrossBuildRuntime.h>
#include <MinHook.h>

#define DECLARE_ACCESSOR(x) \
	decltype(impl.m2060.x)& x()        \
	{                       \
		return (xbr::IsGameBuildOrGreater<2060>() ? impl.m2060.x : impl.m1604.x);   \
	} \
	const decltype(impl.m2060.x)& x() const                         \
	{                                                    \
		return (xbr::IsGameBuildOrGreater<2060>() ? impl.m2060.x : impl.m1604.x);  \
	}

using Matrix3x4 = DirectX::XMFLOAT3X4;

struct Vector
{
	float x; // +0
	float y; // +4
	float z; // +8
	float w; // +16
};

struct iCEntityDef
{
	void* vtable; // +0
	uint32_t archetypeName; // +8
	uint32_t flags; // +12
	char pad1[16]; // +16
	Vector position; // +32
	Vector rotation; // +48
	float scaleXY; // +64
	float scaleZ; // +68
	int16_t parentIndex; // +72
	uint16_t lodDist; // +74
	uint16_t childLodDist; // +74
	char pad2[36]; // +76 (todo: extensions)
	float ambientOcclusionMultiplier; // +112
	float artificialAmbientOcclusion; // +116
	int16_t tintValue; // +120
	char pad3[6]; // +122
};

struct CMloRoomDef
{
	void* vtable; // +0
	char* name; // +8
	int64_t unkFlag; // +16
	char pad1[8]; // +24
	Vector bbMin; // +32
	Vector bbMax; // +48
	float blend; // +64
	uint32_t timecycleName; // +68
	uint32_t secondaryTimecycleName;
	uint32_t flags; // +76
	uint32_t portalsCount; // +80
	int32_t floorId; // +84
	int16_t exteriorVisibilityDepth; // +88
	atArray<uint32_t> attachedObjects; // +90
};

struct CMloPortalDef
{
	void* vtable; // +0
	uint32_t roomFrom; // +8
	uint32_t roomTo; // +12
	uint32_t flags; // +16
	int32_t mirrorPriority; // +20
	float opacity;	// +24
	int32_t audioOcclusion; // +28
	atArray<Vector> corners; // +32
	atArray<uint32_t> attachedObjects; // +48
};

struct CMloEntitySet
{
	void* vtable; // +0
	uint64_t name; // +8
	atArray<int32_t> locations; // +12
	atArray<iCEntityDef> entities; // +28
};

struct CMloTimeCycleModifier
{
	void* vtable; // +0
	uint64_t name; // +8
	Vector sphere; // +16
	float percentage; // +32
	float range; // +36
	uint32_t startHour; // +40
	uint32_t endHour; // +44
};

struct CMloModelInfo
{
	char pad1[200]; // +0
	atArray<iCEntityDef*>* entities; // +200
	atArray<CMloRoomDef>* rooms; // +208
	atArray<CMloPortalDef>* portals; // +216
	atArray<CMloEntitySet>* entitySets; // +224
	atArray<CMloTimeCycleModifier>* timecycleModifiers; // +232
};

struct CInteriorInst
{
	char pad1[32]; // +0
	CMloModelInfo* mloModel; // +32
	char pad2[56]; // +40
	Matrix3x4 matrix; // +96
	Vector position; // +144
	char pad3[228]; // +164
	// CInteriorProxy* proxy; // +392
};

struct InteriorProxy
{
public:
	struct Impl1604
	{
		void* vtbl;
		uint32_t mapIndex; // +8
		char pad1[4]; // +12
		uint32_t occlusionIndex; // +16
		char pad2[44]; // +20
		CInteriorInst* instance; // +64
		char pad3[24]; // +72
		Vector rotation; // +96
		Vector position; // +112
		Vector entitiesExtentsMin; // +128
		Vector entitiesExtentsMax; // +144
		char pad4[68]; // +160
		uint32_t archetypeHash; // +228
		char pad5[8]; // +232
	};

	struct Impl2060
	{
		void* vtbl;
		uint32_t mapIndex; // +8
		char pad1[4]; // +12
		uint32_t occlusionIndex; // +16
		char pad2[44]; // +20
		uint32_t unkFlag; // +64, some flag added in 1868, hardcoded for ch_dlc_arcade
		char pad3[4]; // +68
		CInteriorInst* instance; // +72
		char pad4[16]; // +80
		Vector rotation; // +96
		Vector position; // +112
		Vector entitiesExtentsMin; // +128
		Vector entitiesExtentsMax; // +144
		char pad5[68]; // +160
		uint32_t archetypeHash; // +228
		char pad6[8]; // +232
	};

	union
	{
		Impl1604 m1604;
		Impl2060 m2060;
	} impl;

public:
	DECLARE_ACCESSOR(instance);
	DECLARE_ACCESSOR(rotation);
	DECLARE_ACCESSOR(position);
	DECLARE_ACCESSOR(entitiesExtentsMin);
	DECLARE_ACCESSOR(entitiesExtentsMax);
};

template<int Build>
using CInteriorProxy = std::conditional_t<(Build >= 2060), InteriorProxy::Impl2060, InteriorProxy::Impl1604>;

template<int Build>
static atPool<CInteriorProxy<Build>>** g_interiorProxyPool;

template<int Build>
static CInteriorProxy<Build>* GetInteriorProxy(int handle)
{
	return (*g_interiorProxyPool<Build>)->GetAtHandle<CInteriorProxy<Build>>(handle);
}

static CMloModelInfo* GetInteriorArchetype(int interiorId)
{
	CInteriorInst* instance = nullptr;

	if (xbr::IsGameBuildOrGreater<2060>())
	{
		CInteriorProxy<2060>* proxy = GetInteriorProxy<2060>(interiorId);
		if (proxy)
		{
			instance = proxy->instance;
		}
	}
	else
	{
		CInteriorProxy<1604>* proxy = GetInteriorProxy<1604>(interiorId);
		if (proxy)
		{
			instance = proxy->instance;
		}
	}

	if (instance && instance->mloModel)
	{
		return instance->mloModel;
	}

	return nullptr;
}

static CMloRoomDef* GetInteriorRoomDef(int interiorId, int roomId)
{
	CMloModelInfo* arch = GetInteriorArchetype(interiorId);

	if (arch == nullptr || roomId < 0 || roomId > arch->rooms->GetCount())
	{
		return nullptr;
	}

	return &(arch->rooms->Get(roomId));
}

static CMloPortalDef* GetInteriorPortalDef(int interiorId, int portalId)
{
	CMloModelInfo* arch = GetInteriorArchetype(interiorId);

	if (arch == nullptr || portalId < 0 || portalId > arch->portals->GetCount())
	{
		return nullptr;
	}

	return &(arch->portals->Get(portalId));
}

static CMloEntitySet* GetInteriorEntitySet(int interiorId, int setId)
{
	CMloModelInfo* arch = GetInteriorArchetype(interiorId);

	if (arch == nullptr || setId < 0 || setId > arch->entitySets->GetCount())
	{
		return nullptr;
	}

	return &(arch->entitySets->Get(setId));
}

static iCEntityDef* GetInteriorPortalEntityDef(int interiorId, int portalId, int entityId)
{
	CMloModelInfo* arch = GetInteriorArchetype(interiorId);
	if (arch == nullptr)
	{
		return nullptr;
	}

	CMloPortalDef* portalDef = GetInteriorPortalDef(interiorId, portalId);
	if (portalDef == nullptr)
	{
		return nullptr;
	}

	if (entityId < 0 || entityId > (portalDef->attachedObjects.GetCount()) - 1)
	{
		return nullptr;
	}

	return arch->entities->Get(portalDef->attachedObjects[entityId]);
}

static CMloTimeCycleModifier* GetInteriorTimecycleModifier(int interiorId, int modId)
{
	CMloModelInfo* arch = GetInteriorArchetype(interiorId);

	if (arch == nullptr || modId < 0 || modId > arch->timecycleModifiers->GetCount())
	{
		return nullptr;
	}

	return &(arch->timecycleModifiers->Get(modId));
}

static int GetInteriorRoomIdByHash(CMloModelInfo* arch, int searchHash)
{
	auto count = arch->rooms->GetCount();

	for (int i = 0; i < count; ++i)
	{
		CMloRoomDef* room = &(arch->rooms->Get(i));

		if (HashString(room->name) == searchHash)
		{
			return i;
		}
	}

	return -1;
}

static void (*g_origsub_14034F024)(__int64 a1, void* envGroup, uint64_t a3, float* a4, float* a5);

static void sub_14034F024(__int64 a1, void* envGroup, uint64_t a3, float* a4, float* a5)
{
	return g_origsub_14034F024(a1, envGroup, a3, a4, a5);
}

#include <shared_mutex>
#include <map>
#include <ScriptSerialization.h>

template<std::size_t Index, typename ReturnType, typename... Args>
inline ReturnType call_virtual(void* instance, Args... args)
{
	using Fn = ReturnType(__thiscall*)(void*, Args...);

	auto function = (*reinterpret_cast<Fn**>(instance))[Index];
	return function(instance, args...);
}

struct CPedFactory
{
	virtual ~CPedFactory() = 0;

	CPed* localPlayerPed;
};

static CPedFactory** g_pedFactory;

struct VirtualBase
{
	virtual ~VirtualBase()
	{
	}
};

struct VirtualDerivative : public VirtualBase
{
	virtual ~VirtualDerivative() override
	{
	}
};

struct SoundRoutingEntry
{
	float routeEndX;
	float routeEndY;
	float routeEndZ;

	float routeStartX;
	float routeStartY;
	float routeStartZ;

	float occlusionFactor;

	std::string envGroupName;
	std::string audEntName;

	uint64_t envGroup;

	struct SoundRoutingHop
	{
		float x;
		float y;
		float z;

		float occlusionFactor;
		float distance;
		MSGPACK_DEFINE_ARRAY(x, y, z, occlusionFactor, distance)
	};
	std::vector<SoundRoutingHop> hops;

	MSGPACK_DEFINE_ARRAY(routeEndX, routeEndY, routeEndZ, routeStartX, routeStartY, routeStartZ, occlusionFactor, envGroupName, audEntName, envGroup, hops)
};
std::vector<SoundRoutingEntry> g_soundRoutingEntries;

class __struct_v9
{
public:
	DirectX::XMFLOAT4 vec1; //0x0000
	DirectX::XMFLOAT4 vec2; //0x0010
	DirectX::XMFLOAT4 vec3; //0x0020
	__struct_v9* nextInPath; //0x0030
	DirectX::XMFLOAT4X4* portalCoords; //0x0038
	uint32_t occlusionHash; //0x0040
	uint32_t roomIndex; //0x0044
	float audCurveFactor; //0x0048
	float occlusionFactor; //0x004C
	float distance; //0x0050
	float N00002B20; //0x0054
	char pad_0058[4]; //0x0058
	bool processedToEnd; //0x005C
	char pad_005D[3]; //0x005D
	atArray<__struct_v9> linkedNodes;//0x0060
}; //Size: 0x0070
constexpr int dsd = sizeof(__struct_v9);

std::map<int8_t*, const char*> g_EnvironmentGroups;
static int8_t* (*g_orig__naEnvironmentGroup__Allocate)(const char* name);
static int8_t* naEnvironmentGroup__Allocate(const char* name)
{
	auto envGroup = g_orig__naEnvironmentGroup__Allocate(name);
	g_EnvironmentGroups.insert({ envGroup, name });

	return envGroup;
}

static void (*g_orig__naEnvironmentGroupManager__Update)(__int64 a1, __int64 envGroups, int MaxEnvironmentGroupsToUpdate, unsigned int gameTime);
static void naEnvironmentGroupManager__Update(__int64 a1, __int64 envGroups, int MaxEnvironmentGroupsToUpdate, unsigned int gameTime)
{
	g_orig__naEnvironmentGroupManager__Update(a1, envGroups, MaxEnvironmentGroupsToUpdate, gameTime);
}

static __int64 (*g_origsub_1403BC95C)(__int64 a1, __struct_v9* a2, uint64_t envGroup, Vector3* a4);
static __int64 sub_1403BC95C(__int64 a1, __struct_v9* a2, uint64_t envGroup, Vector3* a4)
